const regex = {
    username: /^[a-z0-9_]{3,20}$/,
    password: /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)(?=.*[@$!%*?&])[A-Za-z\d@$!%*?&]{8,}$/,
    first_name: /^[a-zàáâäãåąčćęèéêëėįìíîïłńòóôöõøùúûüųūÿýżźñçčšž∂ð,.'-]{2,20}$/,
    last_name: /^[a-zàáâäãåąčćęèéêëėįìíîïłńòóôöõøùúûüųūÿýżźñçčšž∂ð,.'-]{2,20}$/,
    mail: /^[^\W][a-z0-9_]+(\.[a-z0-9_]+)*@[a-z0-9_]+(\.[a-z0-9_]+)*\.[a-z]{2,4}$/,
    sha256: /^[A-Fa-f0-9]{64}$/,
    github_code: /^[a-f0-9]{20}$/,
    lang: /^fr$|^en$/,
    jwt: /^[A-Za-z0-9-_=]+\.[A-Za-z0-9-_=]+\.?[A-Za-z0-9-_.+/=]*$/,
    mongo_id: /^[a-f\d]{24}$/i,
    comment_content: /^.{1,80}$/
}

export { regex }